renesas/ra-fsp-examples/example_projects/ek_ra4m3/usb_otg_msc/usb_otg_msc_ek_ra4m3_ep/e2studio/src/SERIAL_TERM/r_uarta/r_uarta.c
/***********************************************************************************************************************
 * Private Functions
 **********************************************************************************************************************/

#if (UARTA_CFG_PARAM_CHECKING_ENABLE)

/*******************************************************************************************************************//**
 * Parameter error check function for read/write.
 *
 * @param[in] p_ctrl Pointer to the control block for the channel
 * @param[in] addr   Pointer to the buffer
 * @param[in] bytes  Number of bytes to read or write
 *
 * @retval  FSP_SUCCESS              No parameter error found
 * @retval  FSP_ERR_NOT_OPEN         The control block has not been opened
 * @retval  FSP_ERR_ASSERTION        Pointer to UARTA control block or configuration structure is NULL
 **********************************************************************************************************************/
static fsp_err_t r_uarta_read_write_param_check (uarta_instance_ctrl_t const * const p_ctrl,
                                                 uint8_t const * const               addr,
                                                 uint32_t const                      bytes)
{
    FSP_ASSERT(p_ctrl);
    FSP_ASSERT(addr);
    FSP_ASSERT(0U != bytes);
    FSP_ASSERT(UARTA_MAX_TRANSFER_BYTES >= bytes);
    FSP_ERROR_RETURN(UARTA_OPEN == p_ctrl->open, FSP_ERR_NOT_OPEN);

    return FSP_SUCCESS;
}

#endif

#if UARTA_CFG_DTC_SUPPORT_ENABLE

/*******************************************************************************************************************//**
 * Subroutine to apply common UARTA transfer settings.
 *
 * @param[in]  p_ctrl             Pointer to instance control block.
 *
 * @retval     FSP_SUCCESS        UARTA transfer drivers successfully configured
 * @retval     FSP_ERR_ASSERTION  Invalid pointer
 **********************************************************************************************************************/
static fsp_err_t r_uarta_transfer_configure (uarta_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

 #if (UARTA_CFG_RX_ENABLE)
    transfer_instance_t const * p_transfer_rx = p_ctrl->p_cfg->p_transfer_rx;

    /* If a transfer instance is used for reception, apply UART specific settings and open the transfer instance. */
    err = r_uarta_transfer_configure_helper(p_ctrl, p_transfer_rx, UART_DIR_RX);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
 #endif

 #if (UARTA_CFG_TX_ENABLE)
    transfer_instance_t const * p_transfer_tx = p_ctrl->p_cfg->p_transfer_tx;

    /* If a transfer instance is used for transmission, apply UART specific settings and open the transfer instance. */
    err = r_uarta_transfer_configure_helper(p_ctrl, p_transfer_tx, UART_DIR_TX);
  #if (UARTA_CFG_RX_ENABLE)
    if ((err != FSP_SUCCESS) && (NULL != p_transfer_rx))
    {
        p_transfer_rx->p_api->close(p_transfer_rx->p_ctrl);
    }
  #endif
 #endif

    return err;
}

/*******************************************************************************************************************//**
 * This function initializes transfer descriptor
 *
 * @param[in] p_transfer                     Pointer to transfer instance.
 * @param[in] direction                      UART_DIR_TX or UART_DIR_RX.
 **********************************************************************************************************************/
static fsp_err_t r_uarta_transfer_configure_helper (uarta_instance_ctrl_t * const p_ctrl,
                                                    transfer_instance_t const   * p_transfer,
                                                    uart_dir_t                    direction)
{
    fsp_err_t err = FSP_SUCCESS;

    if (NULL != p_transfer)
    {
        /* Configure the transfer instance, if enabled. */
 #if (UARTA_CFG_PARAM_CHECKING_ENABLE)
        FSP_ASSERT(NULL != p_transfer->p_api);
        FSP_ASSERT(NULL != p_transfer->p_ctrl);
        FSP_ASSERT(NULL != p_transfer->p_cfg);
        FSP_ASSERT(NULL != p_transfer->p_cfg->p_info);
        FSP_ASSERT(NULL != p_transfer->p_cfg->p_extend);
 #endif

        transfer_info_t * p_info = p_transfer->p_cfg->p_info;

        /* Casting for compatibility with 5, 7 or 8 bit mode. */
        if (UART_DIR_RX == direction)
        {
            p_info->transfer_settings_word = UARTA_DTC_RX_TRANSFER_SETTINGS;
            p_info->p_src = (void *) &(p_ctrl->p_reg->RXBAn);
        }
        else
        {
            p_info->transfer_settings_word = UARTA_DTC_TX_TRANSFER_SETTINGS;
            p_info->p_dest                 = (void *) &(p_ctrl->p_reg->TXBAn);
        }

        err = p_transfer->p_api->open(p_transfer->p_ctrl, p_transfer->p_cfg);
    }

    return err;
}

#endif

/*******************************************************************************************************************//**
 * Changes baud rate based on predetermined register settings.
 *
 * @param[in]  p_ctrl            Pointer to instance control block.
 * @param[in]  p_baud_setting    Pointer to other divisor related settings
 *
 * @note   The transmitter and receiver (TXEA and RXEA bits in ASIMA00) must be disabled prior to calling this function.
 **********************************************************************************************************************/
static void r_uarta_baud_set (uarta_instance_ctrl_t * p_ctrl, uarta_baud_setting_t const * const p_baud_setting)
{
    /* Set BRGCA register value. */
    p_ctrl->p_reg->BRGCAn = p_baud_setting->brgca;
    uint8_t utack_value = p_baud_setting->utanck_clock;

#if (BSP_FEATURE_UARTA_HAS_CLOCK_OUTPUT)

    /* Set the UART configuration settings provided in ::uart_cfg_t and :: uarta_extended_cfg_t. */
    utack_value |= (uint8_t) (((uarta_extended_cfg_t *) p_ctrl->p_cfg->p_extend)->clock_output <<
                              R_UARTA_CK_UTAnCK_EN_Pos);
#endif

    /* Set UTA0CK/UTA1CK register value. */
    R_UARTA_CK->UTAnCK[p_ctrl->p_cfg->channel] = utack_value;

#if (BSP_PERIPHERAL_UARTA_CHANNEL_MASK > 1)

