renesas/ra-fsp-examples/example_projects/ek_ra4m3/usb_otg_msc/usb_otg_msc_ek_ra4m3_ep/e2studio/src/SERIAL_TERM/r_uarta/r_uarta.c
 #if (BSP_FEATURE_ICU_HAS_IELSR)

    /* Clear pending IRQ to make sure it doesn't fire again after exiting */
    R_BSP_IrqStatusClear(irq);
 #endif

    /* Recover ISR context saved in open. */
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) R_FSP_IsrContextGet(irq);

    if (0U < p_ctrl->tx_src_bytes)
    {
 #if UARTA_CFG_DTC_SUPPORT_ENABLE
        if (NULL == p_ctrl->p_cfg->p_transfer_tx)
 #endif
        {
            /* Write 1byte (uint8_t) data to (uint8_t) data register */
            p_ctrl->p_reg->TXBAn = *(p_ctrl->p_tx_src);

            /* Update pointer to the next data and number of remaining bytes in the control block. */
            p_ctrl->tx_src_bytes -= 1U;
            p_ctrl->p_tx_src     += 1U;
        }

 #if UARTA_CFG_DTC_SUPPORT_ENABLE
        else
        {
            p_ctrl->tx_src_bytes = 0;
        }
 #endif
    }
    else if (0U != (p_ctrl->p_reg->ASIMAn0 & R_UARTA0_ASIMAn0_ISSMA_Msk))
    {
        p_ctrl->p_reg->ASIMAn0_b.ISSMA = 0U;
    }
    else if (0 == p_ctrl->tx_src_bytes)
    {
        r_uarta_call_callback(p_ctrl, 0U, UART_EVENT_TX_COMPLETE);
    }
    else
    {
        /* Do nothing */
    }

    /* Restore context if RTOS is used */
    FSP_CONTEXT_RESTORE;
}

#endif

#if (UARTA_CFG_RX_ENABLE)

/*******************************************************************************************************************//**
 * RXI interrupt processing for UART mode. RXI interrupt happens when data arrives to the data register or the
 * register.  This function calls callback function when it meets conditions below.
 *  - UART_EVENT_RX_COMPLETE: The number of data which has been read reaches to the number specified in R_UARTA_Read()
 *    if a transfer instance is used for reception.
 *  - UART_EVENT_RX_CHAR: Data is received asynchronously (read has not been called)
 *
 * @retval    none
 **********************************************************************************************************************/
void uarta_rxi_isr (void)
{
    /* Save context if RTOS is used */
    FSP_CONTEXT_SAVE;

    IRQn_Type irq = R_FSP_CurrentIrqGet();

 #if (BSP_FEATURE_ICU_HAS_IELSR)

    /* Clear pending IRQ to make sure it doesn't fire again after exiting */
    R_BSP_IrqStatusClear(irq);
 #endif

    /* Recover ISR context saved in open. */
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) R_FSP_IsrContextGet(irq);
 #if UARTA_CFG_DTC_SUPPORT_ENABLE
    if ((p_ctrl->p_cfg->p_transfer_rx == NULL) || (0 == p_ctrl->rx_dest_bytes))
 #endif
    {
        uint8_t data = p_ctrl->p_reg->RXBAn;
 #if (UARTA_CFG_RECEIVE_ERROR_INTERRUPT_MODE != 0)

        /* Determine cause of error. */
        uint8_t err_type = p_ctrl->p_reg->ASISAn;

        /* Clear error condition. */
        p_ctrl->p_reg->ASCTAn = UARTA_ASISA_RCVR_ERR_MASK;

        err_type &= (uint8_t) UARTA_ASISA_RCVR_ERR_MASK;
        err_type  = uarta_event_lut[err_type];
        if (err_type)
        {
            r_uarta_call_callback(p_ctrl, data, (uart_event_t) err_type);
        }
        else
 #endif
        {
            if (0 == p_ctrl->rx_dest_bytes)
            {
                /* Call user callback with the data. */
                r_uarta_call_callback(p_ctrl, (uint32_t) data, UART_EVENT_RX_CHAR);
            }
            else
            {
                *(p_ctrl->p_rx_dest)   = data;
                p_ctrl->p_rx_dest     += 1;
                p_ctrl->rx_dest_bytes -= 1;

                if (0 == p_ctrl->rx_dest_bytes)
                {
                    r_uarta_call_callback(p_ctrl, 0U, UART_EVENT_RX_COMPLETE);
                }
            }
        }
    }

 #if UARTA_CFG_DTC_SUPPORT_ENABLE
    else
    {
        p_ctrl->rx_dest_bytes = 0;
        r_uarta_call_callback(p_ctrl, 0U, UART_EVENT_RX_COMPLETE);
    }
 #endif

    /* Restore context if RTOS is used */
    FSP_CONTEXT_RESTORE;
}

/*******************************************************************************************************************//**
 * ERI interrupt processing for UARTA mode. When an ERI interrupt fires, the user callback function is called if it is
 * registered in R_UARTA_Open() with the event code that triggered the interrupt.
 **********************************************************************************************************************/
void uarta_eri_isr (void)
{
 #if (UARTA_CFG_RECEIVE_ERROR_INTERRUPT_MODE == 0)

    /* Save context if RTOS is used */
    FSP_CONTEXT_SAVE;

    IRQn_Type irq = R_FSP_CurrentIrqGet();

    /* Recover ISR context saved in open. */
    uarta_instance_ctrl_t * p_ctrl = (uarta_instance_ctrl_t *) R_FSP_IsrContextGet(irq);

    uint8_t data = p_ctrl->p_reg->RXBAn;

    uint8_t err_type = p_ctrl->p_reg->ASISAn;

    /* Clear error condition. */
    p_ctrl->p_reg->ASCTAn = UARTA_ASISA_RCVR_ERR_MASK;

    err_type &= (uint8_t) UARTA_ASISA_RCVR_ERR_MASK;
    err_type  = uarta_event_lut[err_type];
    r_uarta_call_callback(p_ctrl, data, (uart_event_t) err_type);

  #if (BSP_FEATURE_ICU_HAS_IELSR)

    /* Clear pending IRQ to make sure it doesn't fire again after exiting */
    R_BSP_IrqStatusClear(irq);
  #endif

    /* Restore context if RTOS is used */
    FSP_CONTEXT_RESTORE;
 #endif
}

#endif

#endif /* BSP_PERIPHERAL_UARTA_PRESENT */

#else /* USE_VIRTUAL_COM = 0 */
/* Add empty interrupt functions to avoid building errors when the user selects RTT Viewer */
void uarta_rxi_isr(void);
void uarta_txi_isr(void);
void uarta_eri_isr(void);

void uarta_rxi_isr (void)
{
    /* Do nothing */
}

void uarta_txi_isr (void)
{
    /* Do nothing */
}

void uarta_eri_isr (void)
{
    /* Do nothing */
}
#endif /* USE_VIRTUAL_COM */
